cf/DataProcessors/РасчетЦенПоСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>РасчетЦенПоСебестоимости</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Comment>в будущем должен замениться на sorting_weight</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>sorting_weight</Name>
					<Comment>чем больше вес, тем выше позиция (по умолчанию 0)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПрайса</Name>
					<Comment>кода устоновили цену в навижене</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/РасчетЦенПоСебестоимости/Forms/ЦеныКонкурентов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БазовыйТипЦен = Параметры.БазовыйТипЦен;	
	Элементы.ЦенаБазовая.Заголовок = Строка(БазовыйТипЦен) + ", " + Строка(БазовыйТипЦен.Валюта);
	           
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НаДату = ВладелецФормы.Объект.НаДату;
	ЗаполнитьТаблицу(ВладелецФормы.Цены);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу(Знач Таблица)
	
	ИмяКолонки = СтрЗаменить(Строка(БазовыйТипЦен.УникальныйИдентификатор()),"-","");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос("	ВЫБРАТЬ
							|	Товары.Номенклатура,
							|	Товары.Артикул,
							|	Товары.Количество, " + "Товары.БазовыйТипНоваяЦена" + ИмяКолонки + " НоваяЦена 
							|ПОМЕСТИТЬ
							|	ТоварыДокумента
							|ИЗ
							|	&ВыбТаблица КАК Товары");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	                                     
	Запрос.УстановитьПараметр("ВыбТаблица", Таблица.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Тов.Номенклатура, 
	|   Тов.Артикул,
	|	Тов.Количество,
	|	Тов.Аналог,
	|	Тов.Аналог.Артикул	АртикулАналог, 
	|	Тов.НоваяЦена		ЦенаБазовая,
	//|   Цен.Цена 
	|   Кон.Цена ЦенаАналога
	|ИЗ	
	|	(ВЫБРАТЬ
	|		Таб.Номенклатура,
	|		Таб.Артикул,
	|		Таб.Количество,
	|		Таб.НоваяЦена,
	|		ВЫБОР КОГДА
	|			Рег.Номенклатура1.Производитель = &Производитель
	|		ТОГДА
	|			Рег.Номенклатура1
	|		ИНАЧЕ
	|			ВЫБОР КОГДА
	|				Рег.Номенклатура2.Производитель = &Производитель
	|			ТОГДА
	|				Рег.Номенклатура2
	|	    	КОНЕЦ
	|		КОНЕЦ Аналог
	|	 ИЗ
	|		ТоварыДокумента Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналогиНоменклатуры Рег
	|		ПО
	|			Таб.Номенклатура = Рег.Номенклатура1 ИЛИ
	|			Таб.Номенклатура = Рег.Номенклатура2		
	|	ГДЕ
	|		Рег.Основной = ИСТИНА
	|		И (Рег.Номенклатура1.Производитель = &Производитель И Рег.Номенклатура1 <> Таб.Номенклатура ИЛИ
	|		Рег.Номенклатура2.Производитель = &Производитель И Рег.Номенклатура2 <> Таб.Номенклатура)	
	|	) Тов
	//|		ЛЕВОЕ СОЕДИНЕНИЕ
	//|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ТипЦен = &ТипЦен) Цен
	//|		ПО 
	//|			Тов.Номенклатура = Цен.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ТипЦен = &ТипЦенКонкурента) Кон
	|		ПО 
	|			Тов.Аналог = Кон.Номенклатура
	|";	
	
	Запрос.УстановитьПараметр("Производитель", Производитель);
	Запрос.УстановитьПараметр("Дата", НаДату);
	Запрос.УстановитьПараметр("ТипЦен", БазовыйТипЦен);
	Запрос.УстановитьПараметр("ТипЦенКонкурента", ТипЦенКонкурента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Цены.Очистить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
					Цены.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриИзмененииТипЦенКонкурентаНаСервере(Знач Таблица)
	
	Элементы.ЦенаАналога.Заголовок = Строка(ТипЦенКонкурента) + ", " + Строка(ТипЦенКонкурента.Валюта) + " (" + Строка(Производитель) + ")";
	ЗаполнитьТаблицу(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенКонкурентаПриИзменении(Элемент)
	
	ПриИзмененииТипЦенКонкурентаНаСервере(ВладелецФормы.Цены);
	
КонецПроцедуры
&НаКлиенте
Процедура ПроизводительПриИзменении(Элемент)
	  
	ЗаполнитьТаблицу(ВладелецФормы.Цены);
	
КонецПроцедуры
